# COFFEE SALES ANALYSIS

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_excel("C:/PROJECTS/COFFEE SALES ANALYSIS/Coffee shop sales(Final).xlsx")

In [3]:
df.head(2)

,transaction_id,transaction_date,transaction_time,store_id,store_location,product_id,transaction_qty,unit_price,total_sales,product_category,product_type,product_detail,Month Name,Day Name,Hour,size,Day of Week,Month
0,1,2023-01-01,07:06:11,5,Lower Manhattan,32,2,3.0,6.0,Coffee,Gourmet brewed coffee,Ethiopia,January,Sunday,7,regular,0,1
1,2,2023-01-01,07:08:56,5,Lower Manhattan,57,2,3.1,6.2,Tea,Brewed Chai tea,Spicy Eye Opener Chai,January,Sunday,7,large,0,1

In [4]:
df.shape

(149116, 18)

In [5]:
df.columns

Index(['transaction_id', 'transaction_date', 'transaction_time', 'store_id',
       'store_location', 'product_id', 'transaction_qty', 'unit_price',
       'total_sales', 'product_category', 'product_type', 'product_detail',
       'Month Name', 'Day Name', 'Hour', 'size', 'Day of Week', 'Month'],
      dtype='object')

# Total Revenue

In [6]:
total_revenue = df['total_sales'].sum().round(2)
print("Total Revenue : ", total_revenue)

Total Revenue :  698812.33

# Total Footfall

In [7]:
total_footfall = df['transaction_id'].count()
print("Total Footfall : ", total_footfall)

Total Footfall :  149116

# Average Bill Per Person

In [8]:
average_cust_bill = df['total_sales'].mean()
print("average_cust_bill : ", round(average_cust_bill,2))

average_cust_bill :  4.69

# Average Order Per Person

In [9]:
average_cust_order = df['transaction_qty'].mean()
print(" Average customer order : ", round(average_cust_order,2))

 Average customer order :  1.44

# Revenue On Each Day

In [10]:
revenue_on_each_day = df.groupby('Day Name')['total_sales'].sum()
print("Revenue on each day : ", revenue_on_each_day)

Revenue on each day :  Day Name
Friday       101373.00
Monday       101677.28
Saturday      96894.48
Sunday        98330.31
Thursday     100767.78
Tuesday       99455.94
Wednesday    100313.54
Name: total_sales, dtype: float64

# Order On Each Day

In [26]:
Order_each_day = df.groupby('Day Name')['transaction_id'].count().reset_index().sort_values(['transaction_id'],ascending = False)
print(" total oprder on each day : ", Order_each_day)

 total oprder on each day :      Day Name  transaction_id
0     Friday           21701
4   Thursday           21654
1     Monday           21643
6  Wednesday           21310
5    Tuesday           21202
3     Sunday           21096
2   Saturday           20510

# Order And Revenue On Each Day

In [12]:
order_and_revenue_on_each_day = df.groupby('Day Name').agg({'transaction_id': 'count' , 'total_sales': 'sum'})
print("Revenue on each day : ", order_and_revenue_on_each_day)

Revenue on each day :             transaction_id  total_sales
Day Name
Friday              21701    101373.00
Monday              21643    101677.28
Saturday            20510     96894.48
Sunday              21096     98330.31
Thursday            21654    100767.78
Tuesday             21202     99455.94
Wednesday           21310    100313.54

# Revenue per hour

In [13]:
hour = df.groupby('Hour')['total_sales'].sum()
print("Revenue per hour : ", hour)

Revenue per hour :  Hour
6     21900.27
7     63526.47
8     82699.87
9     85169.53
10    88673.39
11    46319.14
12    40192.79
13    40367.45
14    41304.74
15    41733.10
16    41122.75
17    40134.31
18    34286.20
19    28446.68
20     2935.64
Name: total_sales, dtype: float64

# Revenue per Month

In [14]:
month = df.groupby('Month Name')['total_sales'].sum().reset_index().sort_values(['total_sales'],ascending = False)
print("Revenue per month : ", month)

Revenue per month :    Month Name  total_sales
3       June    166485.88
5        May    156727.76
0      April    118941.08
4      March     98834.68
2    January     81677.74
1   February     76145.19

# Size Distribuation By Order

In [15]:
order_per_size = df.groupby('size')['transaction_qty'].count()
print(" Order per Size : ", 100*(order_per_size/df['transaction_qty'].count()))

 Order per Size :  size
large          30.100727
not defined    29.854610
regular        30.706966
small           9.337697
Name: transaction_qty, dtype: float64

# Sales and footfall on various locations

In [16]:
sales_footfall_locations = df.groupby('store_location').agg({'transaction_id' : 'count' , 'total_sales' : 'sum'})
print("Footfall and sales over variuous locations : ", sales_footfall_locations)

Footfall and sales over variuous locations :                   transaction_id  total_sales
store_location
Astoria                   50599    232243.91
Hell's Kitchen            50735    236511.17
Lower Manhattan           47782    230057.25

# Revenue Per Category

In [17]:
revenue_category = df.groupby('product_category')['total_sales'].sum().reset_index().sort_values(['total_sales'], ascending = False)
print("Revenue per category : ", revenue_category)

Revenue per category :       product_category  total_sales
2              Coffee    269952.45
8                 Tea    196405.95
0              Bakery     82315.64
4  Drinking Chocolate     72416.00
3        Coffee beans     40085.25
1             Branded     13607.00
6           Loose Tea     11213.60
5            Flavours      8408.80
7  Packaged Chocolate      4407.64

# Revenue based top 5 product

In [18]:
revenue_product_type = df.groupby('product_type')['total_sales'].sum().reset_index().sort_values(['total_sales'], ascending = False).head(5)
print("Revenue per product type  : ", revenue_product_type)

Revenue per product type  :               product_type  total_sales
0        Barista Espresso     91406.20
4         Brewed Chai tea     77081.95
17          Hot chocolate     72416.00
13  Gourmet brewed coffee     70034.60
3        Brewed Black tea     47932.00

# Revenue based top 10 product detail

In [19]:
revenue_product_detail = df.groupby('product_detail')['total_sales'].sum().reset_index().sort_values(['total_sales'],ascending = False).head(10)
print(" Revenue Based Top 10 Product Details Are : ", revenue_product_detail)

 Revenue Based Top 10 Product Details Are :                 product_detail  total_sales
18                   Ethiopia     42304.10
43  Sustainably Grown Organic     39065.10
28      Jamaican Coffee River     38781.15
1                   Brazilian     37746.50
30                      Latte     36369.75
13             Dark chocolate     35785.70
35   Our Old Time Diner Blend     35278.00
10     Columbian Medium Roast     34528.50
3                  Cappuccino     33639.25
32       Morning Sunrise Chai     30587.50